{
    "all_personalities": [
        {
            "name": "Bold",
            "description": "You're so brave, and you never back down from anything!\nAnd you're also gutsy and brash in a way that others aren't!\nYou're not shy about asking to take home all the leftovers at restaurants, right?\nIf someone's treating you to dinner, you have no problem with ordering lots of good stuff!\nAnd you aren't fazed by doing things that most others would think twice about doing.\nPerhaps you don't even notice when others are upset with you!\nYou know, you have the potential to become a truly great person...\nbecause you'll be the last one standing!"
        },
        {
            "name": "Brave",
            "description": "You don't know the meaning of fear!\nYou're not afraid to keep moving forward in the face of danger.\nYou also have a strong sense of justice and can't turn a blind eye to someone in trouble.\nBut you sometimes push your own personal sense of justice a little too hard.\nBe careful that you don't get too pushy!"
        },
        {
            "name": "Calm",
            "description": "You're very compassionate and considerate, and you put friends ahead of yourself.\nYou're so generous and kindhearted that you can laugh,\nforgive, and forget when your friends make mistakes.\nBut be aware that your compassion can sometimes get the best of you,\nputting you too far behind everyone else!"
        },
        {
            "name": "Docile",
            "description": "You're quite sensitive to others!\nYou listen attentively and respectfully, and you're quick to pick up on things.\nBecause you're so good at listening,\ndo you find that your friends tell you their problems and concerns often?\nPerhaps people laugh at you sometimes for being so earnest,\nand not recognizing jokes for what they are.\nBut you're honestly surprised and bashful about this aspect of yourself...\nAnd then honestly laugh about it!"
        },
        {
            "name": "Hardy",
            "description": "You're so determined!\nYou don't whine or feel sorry for yourself, and you never need help with anything.\nYou also have a strong sense of responsibility.\nYou work toward your goals steadily and never require attention along the way.\nYour resilient spirit is the only thing you need to guide you toward your goals.\nBut be careful! You risk wearing yourself out if you work too long all on your own!\nYou should recognize that sometimes you need help from friends."
        },
        {
            "name": "Hasty",
            "description": "You talk quickly! You eat quickly! You walk quickly!\nPeople often see you as a hard worker because you're always moving around so fast!\nBut be careful! If you always rush so fast, you may make mistakes more often than others do.\nAnd what a waste that would be! Relax every now and then with a nice, deep breath!"
        },
        {
            "name": "Impish",
            "description": "You really like to play a lot! And you enjoy eating a lot!\nYou love competition, but you hate losing. Your personality seems crystal clear to others.\nWith you, what you see is what you get! You cheer others with your dazzling smile.\nBut you may be afraid of showing what's in your heart and revealing your true self. You may not want to keep your worries to yourself.\nYou're only human, so ask your friends for advice when you need it."
        },
        {
            "name": "Jolly",
            "description": "You have a good sense of humor, and you're compassionate.\nYou're always making others around you laugh.\nYou have a sunny, positive outlook, and you have a vitality\nthat raises the lowest spirits to giddy heights!\nYet, for all your great cheer, you're also open to tears...\nBut you bounce between laughter and tears so easily!\nWhat an adventure life must be like for you, bouncing around like that all day!"
        },
        {
            "name": "Lonely",
            "description": "At least a little bit! You might find that surprising.\nBut do you think it might be a little true?\nYou know what they say, though...We're all a bit lonely every now and then!\nYou probably keep this fact of life to yourself, though.\nBut if there's one thing that brings us all together...it's our need to go it solo!"
        },
        {
            "name": "Naive",
            "description": "You're so open and innocent! What a strong sense of curiosity you have!\nAnd you state your opinions purely, sharing exactly what you think.\nYou also have an artistic spirit that isn't restrained by social conventions!\nYou startle people with your spontaneity and vision.\nBut when you overdo it, other people can have a hard time keeping up with you...\nHave you noticed people looking at you oddly? As if for no apparent reason?"
        },
        {
            "name": "Quiet",
            "description": "And you're very calm!\nYou're great with numbers, and you analyze information before making decisions.\nYou rarely make mistakes, because you make decisions so calmly and rationally.\nYou also may find it hard to guess what others are thinking,\nand they may find you a touch cold at times.\nYou may not want to keep your feelings to yourself so much of the time."
        },
        {
            "name": "Quirky",
            "description": "You want to be on the cutting edge of fashion!\nYou want to own all the latest stuff, right?\nBut you grow bored of your old things and only like new things!\nYou're true to your emotions, and you follow your desires.\nPeople have a hard time keeping up with you because you change so quickly.\nYou may want to reflect upon how your words and actions affect others."
        },
        {
            "name": "Rash",
            "description": "You seem to be even a bit hasty at times!\nYou may run out of your house an forget to lock the door once in a while.\nAnd you may leave things like umbrellas behind when you leave places.\nMaybe you even dash outside in your slippers every now and then!\nPerhaps you even wear your shirts inside out all the time!\nOh, is that even rasher than you really are? So sorry!"
        },
        {
            "name": "Relaxed",
            "description": "You're so casual, leisurely, and carefree.\nYou don't rush or stress yourself out, and you don't worry about anything.\nYou like to take a seat and kick up your feet!\nYou definitely have an easygoing personality, and you don't sweat the details.\nPeople naturally flock to you because they find you to be a free spirit, which is so refreshing!"
        },
        {
            "name": "Sassy",
            "description": "Or at least somewhat sassy!\nYou don't like taking orders. You're a little rebellious and like to disagree.\nYou're a lone wolf! You like to keep your distance\nfrom groups and go off to do things on your own.\nOlder folks may be ones who find you the most disagreeable, even selfish.\nBut people younger than you tend to really admire you!"
        },
        {
            "name": "Timid",
            "description": "You're quite gentle! You're sometimes a little shy about new things, aren't you?\nDo you miss out on some experiences because you get worried about the newness of the challenge?\nOf course, there's also a great benefit in being cautious, isn't there?\nAfter all, it keeps you nice and safe!\nYou live life at your own speed, with no hurries and no worries!"
        }
    ]
}